Revit 2026 API

# DesignToFabricationConverter Methods

---

The DesignToFabricationConverter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Convert |  |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetConvertedFabricationParts | Gets the set of element identifiers for newly created fabrication parts. |
|  | GetConvertedFabricationPartsWithInvalidConnections | Gets the collection of converted fabrication parts with invalid connections. |
|  | GetDesignElementAndFabricationPartsWithDifferentOffsets | Gets the collection of design elements that failed to convert and the associated set of fabrication parts with different offsets. |
|  | GetDesignElementAndFabricationPartsWithOpenConnectors | Gets the collection of design elements that failed to convert and the associated set of fabrication parts with open connectors. |
|  | GetElementsWithOpenConnector | Gets the set of fabrication part or MEP design element identifiers with open connectors, caused by fittings failing to convert. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetPartialConvertFailureResults | Gets the partial failure results. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | SetMapForFamilySymbolToFabricationPartType |  |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

DesignToFabricationConverter Class

Autodesk.Revit.DB.Fabrication Namespace